Linked List Demo
Commands:
  print:          shows the current contents of the list
  clear:          eliminates all elements from the list
  exit:           exit the program
  insert thing:   inserts the given string into the list
  get index:      get the item at the given index
  contains thing: determine if the given thing is in the list
                  (NOT YET IMPLEMENTED)
list> insert Mario
list> insert Luigi
list> insert Toad
list> insert Bowser
list> insert Princess
list> contains Mario
'Mario' is present
list> contains Luigi
'Luigi' is present
list> contains Princess
'Princess' is present
list> contains Goomba
not found
list> contains Bob-omb
not found
list> exit
